app/controllers/pages_controller.rb

  def index
    @ticket_type = TicketType.find(1)
---
SELECT  "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."id" = $1 LIMIT 1  [["id", 1]]