app/controllers/reserved_seats_controller.rb

  def new
    @movie = Movie.find(params[:movie_id])
    @reserved_seat = ReservedSeat.new
    @buried_seats = ReservedSeat.where(movie_id: params[:movie_id]) #指定された映画の座席予約情報を呼び出す
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "reserved_seats".* FROM "reserved_seats" WHERE "reserved_seats"."movie_id" = $1 LIMIT 1  [["movie_id", 1]]

  def create
    @user = User.find(1) #仮実装。current_userにする
    @reserved_seat = @user.reserved_seats.new(reserved_seat_params)
    @reserved_seat.movie_id = params[:movie_id]
    if @reserved_seat.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "reserved_seats" ("movie_id", "user_id", "seat_number_array", "seat_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["movie_id", 1], ["user_id", 2], ["seat_number_array", "{\"N 2\",\"N 3\"}"], ["seat_number", "1"], ["created_at", "2018-11-23 09:25:14.001502"], ["updated_at", "2018-11-23 09:25:14.001502"]]